// При использовании действия Мультиатака создает диалоговое окно, позволяющее выбрать какую именно атаку совершить, и не закрывается при клике на одну из атак (т.е.давая кликнуть все какие нужны)
// Требуемые модули: Item Macro, MidiQoL
// Это макрос предмета. Он должен быть помещен в Item Macro действия/особенности Мультиатака, а у Мультиатаки в Подробностях нужно указать вызов ItemMacro при использовании.

// Здесь названия атак, доступных в мультиатаке
// Текущие названия для примера, а так сюда в таком же формате нужно вписать названия атак, которые доступны в мультиатаке (Укус, Когти, Топот, и т.д.). Сами атаки должны присутствовать на листе актора, разумеется
let atkNames = ["Атака 1", "Атака 2"];

// Затем ищем нужные предметы
let atkItems = [];
atkNames.forEach(atkName => {
  let atkItem = actor.items.find(i => i.name === atkName );
  atkItems.push(atkItem);
})

// Создаем объект для конфигурации кнопок
let atkBtns = {};
atkItems.forEach((atkItem, index) => {
  let atkBtn = {
    label: atkItem.data.name,
    callback: () => {
      atkItem.roll() // Использование атаки
      multiattackDialog.render(true) // Чтобы диалог не закрывался при нажатии на кнопку атаки
    },
  }
  atkBtns[index+1] = atkBtn;
})

// Сам диалог
let multiattackDialog = new Dialog({
	title: `Dialog Box`,
	content: item.data.data.description.value, // Описание мультиатаки, подтягивает из предмета (чтобы помнить сколько и каких атак может совершить существо)
	buttons: atkBtns,
}).render(true);
